In [20]:
import sqlite3 
from Employee import Employee

In [47]:
conn = sqlite3.connect('Mydatabase.db')
c = conn.cursor()


c.execute("""CREATE TABLE employees (
            first text,
            last text,
            pay integer
            )""")

OperationalError: table employees already exists

In [52]:
res =c. execute("SELECT name FROM sqlite_master WHERE type='table';")

In [54]:
res.fetchall()

[('employees',)]

In [43]:
c.execute("""
          CREATE TABLE employees
          (first_name TEXT,
          last_name TEXT
          salary INTEGER
          )""")
conn.commit()
def insert_emp(emp):
    with conn:
        c.execute("INSERT INTO employees VALUES (:first_name, :last_name, :salary)", 
                  {'first_name':emp.first_name, 'last_name':emp.last_name, 'salary':emp.salary})

#         c.execute("INSERT INTO employees VALUES (:first, :last, :pay)", {'first': emp.first, 'last': emp.last, 'pay': emp.pay})

        #     with conn:
#         c.execute("INSERT INTO employees VALUES (:first_name, :last_name, :salary)", {'first_name':emp.first_name, 'last_name':emp.last_name, 'salary':emp.salary})

# def get_emp_names(last_name):
#     c.exceute("SELECT * FROM employees WHERE last_name=:last_name", {'last_name': last_name})
#     return c.fetchall()

# def raise_salary(emp, salary):
#     with conn:
#         c.execute('''UPDATE employees SET salary = :salary
#                     WHERE first_name = :first_name AND last =: last_name''',
#                   {'first_name': emp.first_name, 'last_name': emp.last_name, 'salary': salary})

# def remove_emp(emp):
#     with conn:
#         c.exceute("DELETE from emloyees WHERE first_name = :first_name AND last_name =:last_name",
#                   {'first_name':emp.first_name, 'last_name':emp.last_name})

In [44]:
emp_1 = Employee("Rahul", "Chavan", 10000)
emp_2 = Employee("Mahesh", "Pawar", 15000)
emp_3 = Employee("Suresh", "Chavan", 20000)

In [46]:
c.execute("INSERT INTO employees VALUES (emp_1.first_name, emp_1.last_name, emp_1.salary)")

OperationalError: no such column: emp_1.first_name

In [35]:
emp_1.first_name

'Rahul'

In [45]:
insert_emp(emp_1)

OperationalError: table employees has 1 columns but 3 values were supplied

In [30]:


insert_emp(emp_1)
insert_emp(emp_2)
insert_emp(emp_3)

emps = get_emp_names("Chavan")
print(emps)

raise_salary(emp_2, 18000)
remove_emp(emp_1)

OperationalError: table employees has 1 columns but 3 values were supplied